fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускиСотрудников</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ВКМ_АнализГрафика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Период.ДатаНачала = НачалоГода(Данные[0]);
	Период.ДатаОкончания = КонецГода(Данные[0]);
	
	ТаблицаГрафикаОтпусков = Данные[1];
	
	ДиаграммаГанта.Очистить();
	
	Для Каждого Строка Из ТаблицаГрафикаОтпусков Цикл
	
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.ВКМ_Сотрудник);
		Точка.Текст = Строка.ВКМ_Сотрудник;
		
		Серия = ДиаграммаГанта.УстановитьСерию(Строка.ВКМ_Сотрудник);
		Серия.Текст = Строка.ВКМ_Сотрудник;	
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия );
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ВКМ_ДатаНачала;
		Интервал.Конец = Строка.ВКМ_ДатаОкончания;	
		
	КонецЦИкла;
	
КонецПроцедуры
